cask_args appdir: "/Applications"

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-versions"

brew "mas"
brew "openssl"
brew "git"
brew "tig"
brew "gibo"
brew "telnet"
brew "mosh"
brew "tmux"
brew "bash"
brew "bash-completion@2"
brew "vagrant-completion"
brew "fzy"
brew "imagemagick"
brew "ffmpeg"
brew "youtube-dl"
brew "heroku/brew/heroku"
brew "anyenv"

mas "Autodesk Pixlr", id: 880663569
mas "Evernote", id: 406056744
mas "Paste Plain Text", id: 1407015686
mas "BetterSnapTool", id: 417375580
mas "Microsoft Remote Desktop 10", id: 1295203466
mas "PopClip", id: 445189367
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "The Unarchiver", id: 425424353
mas "Airmail 3", id: 918858936
mas "LINE", id: 539883307
mas "OneDrive", id: 823766827
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816

# Web Browser
cask 'google-chrome'
cask 'vivaldi'
cask 'firefox'
cask 'firefox-developer-edition'

# Input
cask 'karabiner-elements'
cask 'google-japanese-ime'

# Utility
cask 'appcleaner'
cask 'bitwarden'
cask 'dropbox'
cask 'alfred'
cask 'mi'
cask 'tunnelblick'
cask 'adobe-acrobat-reader'
cask 'coconutbattery'
cask 'forklift'
cask 'keka'
cask 'skim'
cask 'android-file-transfer'
cask 'duet'
cask 'clipy'
cask 'notion'
cask 'boostnote'
cask 'typora'
cask 'authy'
cask 'skitch'

# Entertainment
cask 'station'
cask 'kindle'
cask 'vlc'
cask 'steam'

# Development
cask 'iterm2'
cask 'cyberduck'
cask 'docker'
cask 'visual-studio-code'
cask 'db-browser-for-sqlite'
cask 'java'
cask 'dbeaver-community'
cask 'figma'
