cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-versions"

brew "mas"
brew "openssl"
brew "git"
brew "git-secrets"
brew "tig"
brew "gibo"
brew "cmake"
brew "telnet"
brew "mosh"
brew "tmux"
brew "bash"
brew "bash-completion@2"
brew "fzy"
brew "imagemagick"
brew "ffmpeg"
brew "youtube-dl"
brew "rbenv"
brew "nodenv"
brew "pyenv"
brew "tfenv"
brew "tflint"
brew "postgresql@9.6"
brew "htop"
brew "colordiff"
brew "yarn-completion"
brew "circleci"
brew "graphviz"

mas "Autodesk Pixlr", id: 880663569
mas "Paste Plain Text", id: 1407015686
mas "BetterSnapTool", id: 417375580
mas "Microsoft Remote Desktop 10", id: 1295203466
mas "Pixelmator", id: 407963104
mas "The Unarchiver", id: 425424353
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Battery Indicator", id: 1206020918

# Web Browser
cask "google-chrome"
cask "firefox"
cask "firefox-developer-edition"

# Input
cask "karabiner-elements"
cask "google-japanese-ime"

# Utility
cask "appcleaner"
cask "bitwarden"
cask "alfred"
cask "mi"
cask "tunnelblick"
cask "adobe-acrobat-reader"
cask "skim"
cask "android-file-transfer"
cask "clipy"
cask "authy"
cask "slack"
cask "scroll-reverser"
cask "thunderbird"
cask "inkdrop"
cask "zoom"

# Entertainment
cask "kindle"
cask "vlc"

# Development
cask "iterm2"
cask "docker"
cask "visual-studio-code"
cask "rubymine"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "figma"
cask "google-cloud-sdk"
cask "chromedriver"
cask "gitkraken"
cask "vnc-viewer"
cask "ngrok"
